app/controllers/works_controller.rb

SELECT `works`.* FROM `works`
---
  def index
    @works = Work.all

INSERT INTO `works` (`created_at`, `updated_at`) VALUES ('2019-06-05 00:39:14', '2019-06-05 00:39:14')
---
  def create
    @work = Work.new(work_params)

    respond_to do |format|
      if @work.save

SELECT  `works`.* FROM `works` WHERE `works`.`id` = 0 LIMIT 1
---
    def set_work
      @work = Work.find(params[:id])